var acquisitions = document.getElementById('polarChartFinal');

var labelsAspects = ['Социальный аспект (40%)', 'Управленческий аспект (20%)', 'Предпринимательский аспект (40%)'];

var labelsSocialAspect = ['Вовлечение уязвимых групп (20%)', 'Компоненты теории изменений (60%)', 'Обоснованность достижения соц. воздействия (20%)'];
var labelsManagingAspect = ['Позиционирование как СП (40%)', 'Управление на основе достигнутых соц. результатов (20%)', 'Управление на основе соц. целей (40%)'];
var labelsBusinessAspect = ['Динамика финпоказателей (20%)', 'Диверсификация источников ресурсов для деятельности (30%)', 'Финпоказатели (50%)'];

var labelsAllAspects = [
    'Вовлечение уязвимых групп (20%)', 
    'Компоненты теории изменений (60%)', 
    'Обоснованность достижения соц. воздействия (20%)', 
    'Позиционирование как СП (40%)', 
    'Управление на основе достигнутых соц. результатов (20%)', 
    'Управление на основе соц. целей (40%)',
    'Динамика финпоказателей (20%)', 
    'Диверсификация источников ресурсов для деятельности (30%)', 
    'Финпоказатели (50%)'
]

var data = {
  labels: labelsAspects,
  datasets: [
    {
        type: 'radar',
        labels: labelsAllAspects,
        data: [0.73, 0.811, 0.329, 0.45, 1, 0.67, 0.5, 1, 1]
    },
        {
      label: 'Потенциал Автоматической оценки',
      data: [1, 0.5, 0.6],
      backgroundColor: [
        'rgba(255, 174, 191, 0.5)',
        'rgba(113, 190, 241, 0.5)',
        'rgba(250, 228, 174, 0.5)'
      ]
    },
    {
        label: 'Потенциал оценки с верификацией эксперта',
        data: [0, 1, 1],
        backgroundColor: [
          'rgba(255, 174, 191, 0.75)',
          'rgba(113, 190, 241, 0.75)',
          'rgba(250, 228, 174, 0.75)'
        ]
    },
    {
        label: 'Автоматическая оценка',
        data: [0.6, 0.31, 0.231],
        backgroundColor: [
          'rgba(255, 99, 133, 0.5)',
          'rgba(54, 163, 235, 0.5)',
          'rgba(255, 207, 86, 0.5)'
        ]
    },
    {
      label: 'Совокупная оценка',
      data: [0.6, 0.876, 0.739],
      backgroundColor: [
        'rgba(255, 0, 55, 0.5)',
        'rgba(0, 153, 255, 0.5)',
        'rgba(255, 183, 0, 0.5)'
      ]
    }
  ]
};

var chartOptions = {
  responsive: true,
  elements: {
    line: {
      borderWidth: 3
    }
  },
  plugins: {
    legend: {
      position: 'top',
    },
    title: {
      display: true,
      text: 'Визуализация трех аспектов - Полярный график + Радар'
    }
  }
}

var polarChart = new Chart(acquisitions, {
  type: 'polarArea',
  data: data,
  options: chartOptions
});